ghelia/enchantmoon_kernel/linux-3.0/drivers/net/wireless/rtl8723as/hal/rtl8723a/usb/usb_halinit.c
	// For Min Spacing configuration.
	switch(pHalData->RF_Type)
	{
		case RF_1T2R:
		case RF_1T1R:
			RT_TRACE(COMP_INIT, DBG_LOUD, ("Initializeadapter: RF_Type%s\n", (pHalData->RF_Type==RF_1T1R? "(1T1R)":"(1T2R)")));
			Adapter->MgntInfo.MinSpaceCfg = (MAX_MSS_DENSITY_1T<<3);						
			break;
		case RF_2T2R:
		case RF_2T2R_GREEN:
			RT_TRACE(COMP_INIT, DBG_LOUD, ("Initializeadapter:RF_Type(2T2R)\n"));
			Adapter->MgntInfo.MinSpaceCfg = (MAX_MSS_DENSITY_2T<<3);			
			break;
	}
	
	rtw_write8(Adapter, REG_AMPDU_MIN_SPACE, Adapter->MgntInfo.MinSpaceCfg);
#endif
}

static VOID
_InitRFType(
	IN	PADAPTER Adapter
	)
{
	struct registry_priv	 *pregpriv = &Adapter->registrypriv;
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(Adapter);
	BOOLEAN			is92CU		= IS_92C_SERIAL(pHalData->VersionID);

#if	DISABLE_BB_RF
	pHalData->rf_chip	= RF_PSEUDO_11N;
	return;
#endif

	pHalData->rf_chip	= RF_6052;

	if(_FALSE == is92CU){
		pHalData->rf_type = RF_1T1R;
		DBG_8192C("Set RF Chip ID to RF_6052 and RF type to 1T1R.\n");
		return;
	}

	// TODO: Consider that EEPROM set 92CU to 1T1R later.
	// Force to overwrite setting according to chip version. Ignore EEPROM setting.
	//pHalData->RF_Type = is92CU ? RF_2T2R : RF_1T1R;
	MSG_8192C("Set RF Chip ID to RF_6052 and RF type to %d.\n", pHalData->rf_type);

}

static VOID _InitAdhocWorkaroundParams(IN PADAPTER Adapter)
{
#if RTL8192CU_ADHOC_WORKAROUND_SETTING
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);	
	pHalData->RegBcnCtrlVal = rtw_read8(Adapter, REG_BCN_CTRL);
	pHalData->RegTxPause = rtw_read8(Adapter, REG_TXPAUSE); 
	pHalData->RegFwHwTxQCtrl = rtw_read8(Adapter, REG_FWHW_TXQ_CTRL+2);
	pHalData->RegReg542 = rtw_read8(Adapter, REG_TBTT_PROHIBIT+2);
#endif	
}

// Set CCK and OFDM Block "ON"
static VOID _BBTurnOnBlock(
	IN	PADAPTER		Adapter
	)
{
#if (DISABLE_BB_RF)
	return;
#endif

	PHY_SetBBReg(Adapter, rFPGA0_RFMOD, bCCKEn, 0x1);
	PHY_SetBBReg(Adapter, rFPGA0_RFMOD, bOFDMEn, 0x1);
}

#define MgntActSet_RF_State(...)
static void _RfPowerSave(PADAPTER padapter)
{
#if 0
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;
	rt_rf_power_state eRfPowerStateToSet;
	u8 u1bTmp;


#if (DISABLE_BB_RF)
	return;
#endif
	//
	// 2010/08/11 MH Merge from 8192SE for Minicard init. We need to confirm current radio status
	// and then decide to enable RF or not.!!!??? For Selective suspend mode. We may not 
	// call init_adapter. May cause some problem??
	//
	// Fix the bug that Hw/Sw radio off before S3/S4, the RF off action will not be executed 
	// in MgntActSet_RF_State() after wake up, because the value of pHalData->eRFPowerState 
	// is the same as eRfOff, we should change it to eRfOn after we config RF parameters.
	// Added by tynli. 2010.03.30.
	ppwrctrl->rf_pwrstate = rf_on;
	RT_CLEAR_PS_LEVEL(ppwrctrl, RT_RF_OFF_LEVL_HALT_NIC);
	//Added by chiyokolin, 2011.10.12 for Tx
	rtw_write8(padapter, REG_TXPAUSE, 0x00);

	// 20100326 Joseph: Copy from GPIOChangeRFWorkItemCallBack() function to check HW radio on/off.
	// 20100329 Joseph: Revise and integrate the HW/SW radio off code in initialization.

	eRfPowerStateToSet = (rt_rf_power_state) RfOnOffDetect(padapter);
	ppwrctrl->rfoff_reason |= eRfPowerStateToSet==rf_on ? RF_CHANGE_BY_INIT : RF_CHANGE_BY_HW;
	ppwrctrl->rfoff_reason |= (ppwrctrl->reg_rfoff) ? RF_CHANGE_BY_SW : 0;

	if (ppwrctrl->rfoff_reason & RF_CHANGE_BY_HW)
		ppwrctrl->b_hw_radio_off = _TRUE;

	if (ppwrctrl->reg_rfoff == _TRUE)
	{
		// User disable RF via registry.
		RT_TRACE(_module_hci_hal_init_c_, _drv_notice_, ("InitializeAdapter8192CUsb(): Turn off RF for RegRfOff.\n"));
		MgntActSet_RF_State(padapter, rf_off, RF_CHANGE_BY_SW, _TRUE);

//		if (padapter->bSlaveOfDMSP)
//			return;
	}
	else if (ppwrctrl->rfoff_reason > RF_CHANGE_BY_PS)
	{
		// H/W or S/W RF OFF before sleep.
		RT_TRACE(_module_hci_hal_init_c_, _drv_notice_, ("InitializeAdapter8192CUsb(): Turn off RF for RfOffReason(%ld).\n", pMgntInfo->RfOffReason));
		MgntActSet_RF_State(padapter, rf_off, ppwrctrl->rfoff_reason, _TRUE);
	}
	else
	{
		// Perform GPIO polling to find out current RF state. added by Roger, 2010.04.09.
#if 0
//		if (RT_GetInterfaceSelection(padapter)==INTF_SEL2_MINICARD &&
		if ((pHalData->BoardType == BOARD_MINICARD) &&
			(padapter->MgntInfo.PowerSaveControl.bGpioRfSw))
		{
			RT_TRACE(_module_hci_hal_init_c_, _drv_notice_, ("InitializeAdapter8192CU(): RF=%d \n", eRfPowerStateToSet));
			if (eRfPowerStateToSet == rf_off)
			{
				MgntActSet_RF_State(padapter, rf_off, RF_CHANGE_BY_HW, _TRUE);
				ppwrctrl->b_hw_radio_off = _TRUE;
			}
			else
			{
				ppwrctrl->rf_pwrstate = rf_off;
				ppwrctrl->rfoff_reason = RF_CHANGE_BY_INIT; 
				ppwrctrl->b_hw_radio_off = _FALSE;
				MgntActSet_RF_State(padapter, rf_on, ppwrctrl->rfoff_reason, _TRUE);
			}
		}
		else
#endif
		{
			ppwrctrl->rf_pwrstate = rf_off;
			ppwrctrl->rfoff_reason = RF_CHANGE_BY_INIT;
			MgntActSet_RF_State(padapter, rf_on, ppwrctrl->rfoff_reason, _TRUE);
		}

		ppwrctrl->rfoff_reason = 0; 
		ppwrctrl->b_hw_radio_off = _FALSE;
		ppwrctrl->rf_pwrstate = rf_on;
		if (padapter->ledpriv.LedControlHandler)
			padapter->ledpriv.LedControlHandler(padapter, LED_CTL_POWER_ON);
	}

	// 2010/-8/09 MH For power down module, we need to enable register block contrl reg at 0x1c.
	// Then enable power down control bit of register 0x04 BIT4 and BIT15 as 1.
	if (pHalData->pwrdown && eRfPowerStateToSet == rf_off)
	{
		// Enable register area 0x0-0xc.
		rtw_write8(padapter, REG_RSV_CTRL, 0x0);

		//
		// <Roger_Notes> We should configure HW PDn source for WiFi ONLY, and then
		// our HW will be set in power-down mode if PDn source from all  functions are configured.
		// 2010.10.06.
		//
		u1bTmp = rtw_read8(padapter, REG_MULTI_FUNC_CTRL);
		u1bTmp |= WL_HWPDN_EN;
		rtw_write8(padapter, REG_MULTI_FUNC_CTRL, u1bTmp);
	}
#endif	
}

enum {
	Antenna_Lfet = 1,
	Antenna_Right = 2,	
};
			
//
// 2010/08/09 MH Add for power down check.
//
static BOOLEAN
HalDetectPwrDownMode(
	IN PADAPTER				Adapter
	)
{
	u8	tmpvalue;
	HAL_DATA_TYPE		*pHalData	= GET_HAL_DATA(Adapter);
	struct pwrctrl_priv		*pwrctrlpriv = &Adapter->pwrctrlpriv;
	
	EFUSE_ShadowRead(Adapter, 1, EEPROM_RF_OPT3, (u32 *)&tmpvalue);

