ghelia/enchantmoon_kernel/linux-3.0/drivers/net/wireless/rtl8723as/hal/rtl8723a/usb/usb_halinit.c
_func_enter_;

HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_BEGIN);
	if(Adapter->pwrctrlpriv.bkeepfwalive)
	{
		_ps_open_RF(Adapter);

		if(pHalData->bIQKInitialized ){
			rtl8192c_PHY_IQCalibrate(Adapter,_TRUE);
		}
		else{
			rtl8192c_PHY_IQCalibrate(Adapter,_FALSE);
			pHalData->bIQKInitialized = _TRUE;
		}
		rtl8192c_odm_CheckTXPowerTracking(Adapter);
		rtl8192c_PHY_LCCalibrate(Adapter);

		goto exit;
	}

//	pHalData->bMACFuncEnable = _FALSE;
	// Check if MAC has already power on. by tynli. 2011.05.27.
	val8 = rtw_read8(Adapter, REG_CR);
	RT_TRACE(_module_hci_hal_init_c_, _drv_info_,
			 ("%s: REG_CR 0x100=0x%02x\n", __FUNCTION__, val8));
	//Fix 92DU-VC S3 hang with the reason is that secondary mac is not initialized.
	//0x100 value of first mac is 0xEA while 0x100 value of secondary is 0x00
	//by sherry 20111102
	if (val8 == 0xEA) {
		pHalData->bMACFuncEnable = _FALSE;
	} else {
		pHalData->bMACFuncEnable = _TRUE;
		RT_TRACE(_module_hci_hal_init_c_, _drv_info_,
				 ("%s: MAC has already power on\n", __FUNCTION__));
	}

#if 0
	if(bSupportRemoteWakeUp && Adapter->bWakeFromPnpSleep && pHalData->bMACFuncEnable)
	{
		if(IS_HARDWARE_TYPE_8723AU(Adapter))
		{
			FW_CTRL_PS_MODE FwPwrMode = FW_PS_ACTIVE_MODE;
			
			pHalData->H2CStopInsertQueue = FALSE;
			
			if(pMgntInfo->mAssoc && 
				pMgntInfo->OpMode == RT_OP_MODE_INFRASTRUCTURE &&
				(pMgntInfo->PowerSaveControl.WoWLANLPSLevel > 0))
			{
				RT_TRACE(COMP_POWER, DBG_LOUD, ("FwLPS: Active!!\n"));	
				Adapter->HalFunc.SetHwRegHandler(Adapter, HW_VAR_H2C_FW_PWRMODE, (pu1Byte)(&FwPwrMode));
			}
			
			HalSetFWWoWlanMode92C(Adapter, FALSE);

			// Clear WoWLAN event FTISR[WWLAN_INT_EN].
			if(IS_FW_8723A(Adapter) && Adapter->MgntInfo.FirmwareVersion < 10)
			{
				// Fw revises the bug after version 10.
				value8 = rtw_read8(Adapter, REG_FTISR+3);
				rtw_write8(Adapter, REG_FTISR+3, value8|BIT2);
			}

			SimpleInitializeAdapter8192CUsb(Adapter);

			pMgntInfo->init_adpt_in_progress = FALSE;
			return RT_STATUS_SUCCESS;
		}
	}
#endif


HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_INIT_PW_ON);
	status = _InitPowerOn(Adapter);
	if(status == _FAIL){
		RT_TRACE(_module_hci_hal_init_c_, _drv_err_, ("Failed to init power on!\n"));
		goto exit;
	}

#ifdef CONFIG_BT_COEXIST
	//
	// 2010/09/23 MH Accordgin to Alfred's siggestion. we need to enable SIC to prevent HW
	// to enter suspend mode automatically. If host does not send SOF every 3ms. Or under DTM
	// test with rtl8188cu selective suspend enabler filter driver, WIN host will trigger the device to
	// enter suspend mode after some test (unknow reason now). We need to prevent the case otherwise
	// the register will be 0xea and all TX/RX path stop accidently.
	//
	//
	// 2010/10/01 MH If the OS is XP, host will trigger USB device to enter D3 mode. In CU HW design
	// it will enter suspend mode automatically. In slim combo card, the BT clock will be cut off if HW
	// enter suspend mode. We need to seperate differet case.
	//
	if (BT_IsBtExist(Adapter))
	{
#if 0
#if OS_WIN_FROM_VISTA(OS_VERSION)
		RT_TRACE(COMP_INIT, DBG_LOUD, ("Slim_combo win7/vista need not enable SIC\n"));
#else
		RT_TRACE(COMP_INIT, DBG_LOUD, ("Slim_combo XP enable SIC\n"));
		// 2010/10/15 MH According to Alfre's description, e need to enable bit14 at first an then enable bit12.
		// Otherwise, HW will enter debug mode and 8051 can not work. We need to stay at test mode to enable SIC.
		rtw_write16(Adapter, REG_GPIO_MUXCFG, rtw_read16(Adapter, REG_GPIO_MUXCFG)|BIT14);
		rtw_write16(Adapter, REG_GPIO_MUXCFG, rtw_read16(Adapter, REG_GPIO_MUXCFG)|BIT12);
#endif
#endif
	}
#endif // CONFIG_BT_COEXIST

HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_INIT_LLTT);
	if (!pregistrypriv->wifi_spec) {
		boundary = TX_PAGE_BOUNDARY;
	} else {
		// for WMM
		boundary = WMM_NORMAL_TX_PAGE_BOUNDARY;
	}

	if (!pHalData->bMACFuncEnable)
	{
		status =  InitLLTTable(Adapter, boundary);
		if(status == _FAIL){
			RT_TRACE(_module_hci_hal_init_c_, _drv_err_, ("Failed to init LLT table\n"));
			goto exit;
		}
	}


HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_MISC01);
	if(pHalData->bRDGEnable){
		_InitRDGSetting(Adapter);
	}


HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_DOWNLOAD_FW);
#if (1 == MP_DRIVER)
	_InitRxSetting(Adapter);
	// Don't Download Firmware
	Adapter->bFWReady = _FALSE;
#else
	status = rtl8723a_FirmwareDownload(Adapter);
	if(status != _SUCCESS)
	{
		Adapter->bFWReady = _FALSE;
		pHalData->fw_ractrl = _FALSE;
		DBG_8192C("fw download fail!\n");
		goto exit;
	}	
	else
	{
		Adapter->bFWReady = _TRUE;
		pHalData->fw_ractrl = _TRUE;
		DBG_8192C("fw download ok!\n");	
	}
#endif

	rtl8723a_InitializeFirmwareVars(Adapter);

	if(pwrctrlpriv->reg_rfoff == _TRUE){
		pwrctrlpriv->rf_pwrstate = rf_off;
	}

	// 2010/08/09 MH We need to check if we need to turnon or off RF after detecting
	// HW GPIO pin. Before PHY_RFConfig8192C.
	//HalDetectPwrDownMode(Adapter);
	// 2010/08/26 MH If Efuse does not support sective suspend then disable the function.
	//HalDetectSelectiveSuspendMode(Adapter);

	// Set RF type for BB/RF configuration	
	_InitRFType(Adapter);//->_ReadRFType()

	// Save target channel
	// <Roger_Notes> Current Channel will be updated again later.
	pHalData->CurrentChannel = 6;//default set to 6


HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_MAC);
#if (HAL_MAC_ENABLE == 1)
	status = PHY_MACConfig8723A(Adapter);
	if(status == _FAIL)
	{
		DBG_8192C("PHY_MACConfig8723A fault !!\n");	
		goto exit;
	}
#endif


HAL_INIT_PROFILE_TAG(HAL_INIT_STAGES_BB);
	//
	//d. Initialize BB related configurations.
	//
#if (HAL_BB_ENABLE == 1)
	status = PHY_BBConfig8723A(Adapter);
	if(status == _FAIL)
	{
		DBG_8192C("PHY_BBConfig8723A fault !!\n");	
		goto exit;
	}
#endif

	//
	// 2011/11/15 MH Add for tx power by rate fine tune. We need to call the function after BB config.
	// Because the tx power by rate table is inited in BB config.
	//
//	HAL_AdjustPwrIndexDiffRateOffset(Adapter);
//	HAL_AdjustPwrIndexbyRegistry(Adapter);

#if 0
	// The FW command register update must after MAC and FW init ready.
	if (Adapter->bFWReady == TRUE)
	{		
		if(pDevice->RegUsbSS)
		{
			u1Byte		u1H2CSSRf[3]={0};

			SET_H2CCMD_SELECTIVE_SUSPEND_ROF_CMD_ON(u1H2CSSRf,  1);
			SET_H2CCMD_SELECTIVE_SUSPEND_ROF_CMD_GPIO_PERIOD(u1H2CSSRf, 500);
			
			FillH2CCmd92C(Adapter, H2C_SELECTIVE_SUSPEND_ROF_CMD, 3, u1H2CSSRf);			
			RT_TRACE(COMP_INIT, DBG_LOUD, 
			("SS Set H2C_CMD for FW detect GPIO time=%d\n", GET_H2CCMD_SELECTIVE_SUSPEND_ROF_CMD_GPIO_PERIOD(u1H2CSSRf)));
		}
		else
			RT_TRACE(COMP_INIT, DBG_LOUD, ("Non-SS Driver detect GPIO by itself\n"));
	}
	else
	{
		RT_TRACE(COMP_INIT, DBG_LOUD, ("Adapter->bFWReady == FALSE\n"));
		// 2011/02/11 MH If FW is not ready, we can not enter seecitve suspend mode, otherwise,
		// We can not support GPIO/PBC detection by FW with selectiev suspend support.
		pDevice->RegUsbSS = FALSE;	
	}
#endif


